In [159]:
import pandas as pd
import numpy as np

In [160]:
df=pd.DataFrame({"key1":["a","a","b","b","a"],
                 "key2":["one","two","one","two","one"],
                 "data1":np.random.randn(5),
                 "data2":np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.272388 -0.683688
1    a  two -0.272029  0.820364
2    b  one  1.434368  0.378222
3    b  two  0.457669  0.928428
4    a  one  0.055117 -0.323784

In [161]:
grouped=df["data1"].groupby(df["key1"])

In [162]:
grouped

This grouped variable is now a GroupBy object. It has not actually computed anything.We can apply some 
operation to each of the groups.

In [163]:
grouped.mean()

key1
a    0.018492
b    0.946019
Name: data1, dtype: float64

In [164]:
means=df["data1"].groupby([df["key1"],df["key2"]]).mean()

Here we grouped the data using two keys,and the resulting Series now has a heirarchical index 
consisting of unique pairs of key.

In [165]:
means

key1  key2
a     one     0.163753
      two    -0.272029
b     one     1.434368
      two     0.457669
Name: data1, dtype: float64

In [166]:
states=np.array(["Ohio","California","California","Ohio","Ohio"])

years=np.array([2005,2005,2006,2005,2006])

df["data1"].groupby([states,years]).mean()

California  2005   -0.272029
            2006    1.434368
Ohio        2005    0.365029
            2006    0.055117
Name: data1, dtype: float64

In [167]:
df

  key1 key2     data1     data2
0    a  one  0.272388 -0.683688
1    a  two -0.272029  0.820364
2    b  one  1.434368  0.378222
3    b  two  0.457669  0.928428
4    a  one  0.055117 -0.323784

In [168]:
df.groupby("key1").mean()

         data1     data2
key1
a     0.018492 -0.062369
b     0.946019  0.653325

In [169]:
df.groupby("key2").mean()

         data1     data2
key2
one   0.587291 -0.209750
two   0.092820  0.874396

In [170]:
#Here the key1 is excluded as it is not numeric, it is said to be a nuisance column.

In [171]:
df.groupby(["key1","key2"]).mean()

              data1     data2
key1 key2
a    one   0.163753 -0.503736
     two  -0.272029  0.820364
b    one   1.434368  0.378222
     two   0.457669  0.928428

In [172]:
df.groupby("key1").size()

key1
a    3
b    2
dtype: int64

Iterating over Groups:GroupBy supports iteration,generating a sequence of 2-tuples containing the group name along with
the chunk of data.

In [173]:
for name,group in df.groupby("key1"):
    print(name,"\n")
    print(group,"\n")

a

  key1 key2     data1     data2
0    a  one  0.272388 -0.683688
1    a  two -0.272029  0.820364
4    a  one  0.055117 -0.323784

b

  key1 key2     data1     data2
2    b  one  1.434368  0.378222
3    b  two  0.457669  0.928428

In [174]:
for (k1,k2),group in df.groupby(["key1","key2"]):

        print((k1,k2),"\n")
        print(group,"\n")

('a', 'one')

  key1 key2     data1     data2
0    a  one  0.272388 -0.683688
4    a  one  0.055117 -0.323784

('a', 'two')

  key1 key2     data1     data2
1    a  two -0.272029  0.820364

('b', 'one')

  key1 key2     data1     data2
2    b  one  1.434368  0.378222

('b', 'two')

  key1 key2     data1     data2
3    b  two  0.457669  0.928428

In [175]:
pieces=dict(list(df.groupby("key1")))

In [176]:
pieces["a"]

  key1 key2     data1     data2
0    a  one  0.272388 -0.683688
1    a  two -0.272029  0.820364
4    a  one  0.055117 -0.323784

In [177]:
pieces["b"]

  key1 key2     data1     data2
2    b  one  1.434368  0.378222
3    b  two  0.457669  0.928428

In [178]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one  0.272388 -0.683688
 1    a  two -0.272029  0.820364
 4    a  one  0.055117 -0.323784,
 'b':   key1 key2     data1     data2
 2    b  one  1.434368  0.378222
 3    b  two  0.457669  0.928428}

In [179]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [180]:
grouped=df.groupby(df.dtypes,axis=1)

In [181]:
grouped

In [182]:
for dtype,group in grouped:
    print(dtype,"\n")
    print(group,"\n")

float64

      data1     data2
0  0.272388 -0.683688
1 -0.272029  0.820364
2  1.434368  0.378222
3  0.457669  0.928428
4  0.055117 -0.323784

object

  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

Selecting a Column or Subset of Columns

In [183]:
df.groupby("key1")["data1"]
df.groupby("key1")[["data2"]]

In [184]:
df["data1"].groupby(df["key1"])
df[["data2"]].groupby(df["key1"])

We can for large data sets aggregate only few columns.
To compute the means of data2 column and get the result as a DataFrame.

In [185]:
df.groupby(["key1","key2"])[["data2"]]  #when the column is passed the it returns a DataFrame.

In [186]:
df.groupby(["key1","key2"])[["data2"]].mean()

              data2
key1 key2
a    one  -0.503736
     two   0.820364
b    one   0.378222
     two   0.928428

In [187]:
df.groupby(["key1","key2"])[["data2"]].size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [188]:
df.groupby(["key1","key2"])["data2"] #when the column name is passed as a scalar,then result is a grouped Series

In [189]:
df.groupby(["key1","key2"])["data2"].mean()

key1  key2
a     one    -0.503736
      two     0.820364
b     one     0.378222
      two     0.928428
Name: data2, dtype: float64

In [190]:
#Grouping with Dicts and Series

In [191]:
people=pd.DataFrame(np.random.randn(5,5), 
                    columns=["a","b","c","d","e"],
                    index=["Joe","Steve","Wes","Jim","Travis"])

In [192]:
people.iloc[2:3,[1,2]] =np.nan #Add a few NA values

In [193]:
people

               a         b         c         d         e
Joe     0.345419 -2.521740  0.258350 -2.535924  0.613116
Steve  -0.120253  0.128843  0.025722 -0.561286  0.996410
Wes     0.303041       NaN       NaN  1.008197 -0.470494
Jim     0.168623  1.632439 -0.501921  0.379089 -0.702155
Travis  0.598333  0.100149  0.618297  0.549363  0.365655

In [194]:
mapping={"a":"red","b":"red","c":"blue","d":"blue","e":"red","f":"orange"}

In [195]:
by_column=people.groupby(mapping,axis=1)

In [196]:
by_column.sum()

            blue       red
Joe    -2.277573 -1.563205
Steve  -0.535564  1.005000
Wes     1.008197 -0.167453
Jim    -0.122833  1.098908
Travis  1.167660  1.064137

In [197]:
map_series=pd.Series(mapping)

In [198]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [199]:
people.groupby(map_series, axis=1).sum()

            blue       red
Joe    -2.277573 -1.563205
Steve  -0.535564  1.005000
Wes     1.008197 -0.167453
Jim    -0.122833  1.098908
Travis  1.167660  1.064137

In [200]:
# Groupng with Functions

In [201]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.817082 -0.889301 -0.243571 -1.148638 -0.559532
5 -0.120253  0.128843  0.025722 -0.561286  0.996410
6  0.598333  0.100149  0.618297  0.549363  0.365655

In [202]:
key_list=["one","one","one","two","two"]

In [203]:
people.groupby([len,key_list]).sum()

              a         b         c         d         e
3 one  0.648459 -2.521740  0.258350 -1.527727  0.142622
  two  0.168623  1.632439 -0.501921  0.379089 -0.702155
5 one -0.120253  0.128843  0.025722 -0.561286  0.996410
6 two  0.598333  0.100149  0.618297  0.549363  0.365655

Grouping by Index Levels

In [204]:
columns=pd.MultiIndex.from_arrays([["US","US","US","JP","JP"],[1, 3, 5, 1, 3]],
                                 names=["cty","tenor"])

In [205]:
heir_df=pd.DataFrame(np.random.randn(4,5), columns=columns)

In [206]:
heir_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.363122  0.341637 -1.399213  0.678005 -0.274474
1      0.065956 -0.674698  0.518502 -1.609248  0.381242
2      0.224232 -0.856063  1.033280 -0.297967 -0.801815
3     -1.201201  0.129283  1.591903  0.410716 -1.785058

To group by level, pass the level number or name using the level keyword:

In [207]:
heir_df.groupby(level="cty",axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

#Data Aggregation : Applying Aggregation to any data transformation produces scalar values.

In [208]:
grouped=df.groupby("key1")

In [209]:
grouped["data1"].quantile(0.9) #Internally the GroupBy slices up the Series hence we can use the quantile for each of these 
                               #piece. Quantile is not explicitly implemented for GroupBy

key1
a    0.228934
b    1.336698
Name: data1, dtype: float64

In [210]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [211]:
grouped.agg(peak_to_peak)

C:\Users\kulpr\AppData\Local\Temp\ipykernel_26108\4193407341.py:1: FutureWarning: ['key2'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.544417  1.504051
b     0.976699  0.550206

In [212]:
df.groupby("key1").describe()

     data1                                                             \
     count      mean      std       min       25%       50%       75%
key1
a      3.0  0.018492  0.27405 -0.272029 -0.108456  0.055117  0.163753
b      2.0  0.946019  0.69063  0.457669  0.701844  0.946019  1.190194

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.272388   3.0 -0.062369  0.785363 -0.683688 -0.503736 -0.323784
b     1.434368   2.0  0.653325  0.389055  0.378222  0.515773  0.653325


           75%       max
key1
a     0.248290  0.820364
b     0.790876  0.928428

In [213]:
#Columnwise and Multiple Function Application

In [214]:
import seaborn as sns
tips=sns.load_dataset("tips")

In [215]:
tips["tip_pct"]=tips["tip"]/tips["total_bill"]

In [216]:
tips.head()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [217]:
grouped=tips.groupby(["tip","smoker"])

In [218]:
grouped_pct=grouped["tip_pct"]

In [219]:
grouped_pct.mean()

tip    smoker
1.00   Yes       0.193004
       No        0.137931
1.01   Yes            NaN
       No        0.059447
1.10   Yes       0.085271
                   ...
7.58   No        0.192288
9.00   Yes            NaN
       No        0.186220
10.00  Yes       0.196812
       No             NaN
Name: tip_pct, Length: 246, dtype: float64

In [220]:
grouped_pct.agg("mean")

tip    smoker
1.00   Yes       0.193004
       No        0.137931
1.01   Yes            NaN
       No        0.059447
1.10   Yes       0.085271
                   ...
7.58   No        0.192288
9.00   Yes            NaN
       No        0.186220
10.00  Yes       0.196812
       No             NaN
Name: tip_pct, Length: 246, dtype: float64

In [221]:
grouped_pct.agg(["mean", "std", peak_to_peak])

                  mean       std  peak_to_peak
tip   smoker
1.00  Yes     0.193004  0.124288      0.246368
      No      0.137931       NaN      0.000000
1.01  Yes          NaN       NaN           NaN
      No      0.059447       NaN      0.000000
1.10  Yes     0.085271       NaN      0.000000
...                ...       ...           ...
7.58  No      0.192288       NaN      0.000000
9.00  Yes          NaN       NaN           NaN
      No      0.186220       NaN      0.000000
10.00 Yes     0.196812       NaN      0.000000
      No           NaN       NaN           NaN

[246 rows x 3 columns]

In [222]:
grouped_pct.agg([("M","mean"),("S","std")])  #here we pass a list of (name,function) tuple, the first element of each
                                             #tuple will be used as DataFrame column name

                     M         S
tip   smoker
1.00  Yes     0.193004  0.124288
      No      0.137931       NaN
1.01  Yes          NaN       NaN
      No      0.059447       NaN
1.10  Yes     0.085271       NaN
...                ...       ...
7.58  No      0.192288       NaN
9.00  Yes          NaN       NaN
      No      0.186220       NaN
10.00 Yes     0.196812       NaN
      No           NaN       NaN

[246 rows x 2 columns]

In [223]:
functions=["count", "mean", "max"]

In [224]:
grouped=tips.groupby(["tip", "smoker"])

In [225]:
result=grouped["total_bill","tip_pct"].agg(functions)

C:\Users\kulpr\AppData\Local\Temp\ipykernel_26108\1929162997.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  result=grouped["total_bill","tip_pct"].agg(functions)

In [226]:
result

             total_bill               tip_pct
                  count   mean    max   count      mean       max
tip   smoker
1.00  Yes             3   7.14  12.60       3  0.193004  0.325733
      No              1   7.25   7.25       1  0.137931  0.137931
1.01  Yes             0    NaN    NaN       0       NaN       NaN
      No              1  16.99  16.99       1  0.059447  0.059447
1.10  Yes             1  12.90  12.90       1  0.085271  0.085271
...                 ...    ...    ...     ...       ...       ...
7.58  No              1  39.42  39.42       1  0.192288  0.192288
9.00  Yes             0    NaN    NaN       0       NaN       NaN
      No              1  48.33  48.33       1  0.186220  0.186220
10.00 Yes             1  50.81  50.81       1  0.196812  0.196812
      No              0    NaN    NaN       0       NaN       NaN

[246 rows x 6 columns]

In [227]:
result["tip_pct"]

              count      mean       max
tip   smoker
1.00  Yes         3  0.193004  0.325733
      No          1  0.137931  0.137931
1.01  Yes         0       NaN       NaN
      No          1  0.059447  0.059447
1.10  Yes         1  0.085271  0.085271
...             ...       ...       ...
7.58  No          1  0.192288  0.192288
9.00  Yes         0       NaN       NaN
      No          1  0.186220  0.186220
10.00 Yes         1  0.196812  0.196812
      No          0       NaN       NaN

[246 rows x 3 columns]

In [228]:
ftuples = [("Durchschnitt", "mean"), ("Abweichung", np.var)]

In [229]:
grouped["tip_pct", "total_bill"].agg(ftuples)

C:\Users\kulpr\AppData\Local\Temp\ipykernel_26108\547607895.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  grouped["tip_pct", "total_bill"].agg(ftuples)

                  tip_pct              total_bill
             Durchschnitt Abweichung Durchschnitt Abweichung
tip   smoker
1.00  Yes        0.193004   0.015448         7.14    24.1543
      No         0.137931        NaN         7.25        NaN
1.01  Yes             NaN        NaN          NaN        NaN
      No         0.059447        NaN        16.99        NaN
1.10  Yes        0.085271        NaN        12.90        NaN
...                   ...        ...          ...        ...
7.58  No         0.192288        NaN        39.42        NaN
9.00  Yes             NaN        NaN          NaN        NaN
      No         0.186220        NaN        48.33        NaN
10.00 Yes        0.196812        NaN        50.81        NaN
      No              NaN        NaN          NaN        NaN

[246 rows x 4 columns]

In [230]:
tips.groupby(["tip", "smoker"])["tip_pct", "total_bill"].agg(ftuples)

C:\Users\kulpr\AppData\Local\Temp\ipykernel_26108\4014289686.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  tips.groupby(["tip", "smoker"])["tip_pct", "total_bill"].agg(ftuples)

                  tip_pct              total_bill
             Durchschnitt Abweichung Durchschnitt Abweichung
tip   smoker
1.00  Yes        0.193004   0.015448         7.14    24.1543
      No         0.137931        NaN         7.25        NaN
1.01  Yes             NaN        NaN          NaN        NaN
      No         0.059447        NaN        16.99        NaN
1.10  Yes        0.085271        NaN        12.90        NaN
...                   ...        ...          ...        ...
7.58  No         0.192288        NaN        39.42        NaN
9.00  Yes             NaN        NaN          NaN        NaN
      No         0.186220        NaN        48.33        NaN
10.00 Yes        0.196812        NaN        50.81        NaN
      No              NaN        NaN          NaN        NaN

[246 rows x 4 columns]

In [231]:
#If we wanted to apply different functions to one or more of the columns

In [232]:
grouped.agg({"tip" : np.max , "size" : "sum"})

                tip  size
tip   smoker
1.00  Yes      1.00     5
      No       1.00     1
1.01  Yes       NaN     0
      No       1.01     2
1.10  Yes      1.10     2
...             ...   ...
7.58  No       7.58     4
9.00  Yes       NaN     0
      No       9.00     4
10.00 Yes     10.00     3
      No        NaN     0

[246 rows x 2 columns]

In [233]:
grouped.agg({"tip" : ["min", "max", "mean", "std"], "size" : "count"})

                tip                     size
                min    max   mean  std count
tip   smoker
1.00  Yes      1.00   1.00   1.00  0.0     3
      No       1.00   1.00   1.00  NaN     1
1.01  Yes       NaN    NaN    NaN  NaN     0
      No       1.01   1.01   1.01  NaN     1
1.10  Yes      1.10   1.10   1.10  NaN     1
...             ...    ...    ...  ...   ...
7.58  No       7.58   7.58   7.58  NaN     1
9.00  Yes       NaN    NaN    NaN  NaN     0
      No       9.00   9.00   9.00  NaN     1
10.00 Yes     10.00  10.00  10.00  NaN     1
      No        NaN    NaN    NaN  NaN     0

[246 rows x 5 columns]

In [234]:
# A DataFrame will have hierarchical columns only if multiple functions are applied to atleast one column

In [235]:
#Returning Aggregated Data without Row Indexes use as_index=False

tips.groupby(["day", "smoker"], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0  Thur    Yes   19.190588  3.030000  2.352941  0.163863
1  Thur     No   17.113111  2.673778  2.488889  0.160298
2   Fri    Yes   16.813333  2.714000  2.066667  0.174783
3   Fri     No   18.420000  2.812500  2.250000  0.151650
4   Sat    Yes   21.276667  2.875476  2.476190  0.147906
5   Sat     No   19.661778  3.102889  2.555556  0.158048
6   Sun    Yes   24.120000  3.516842  2.578947  0.187250
7   Sun     No   20.506667  3.167895  2.929825  0.160113

In [236]:
#Apply : General split-apply-combine

In [237]:
def top(df,n,column):
    return df.sort_values(by=column)[-n:]

In [238]:
import seaborn as sns
tips=sns.load_dataset("tips")
tips["tip_pct"]=tips["tip"]/tips["total_bill"]

In [239]:
top(tips,5,"tip")

     total_bill    tip   sex smoker   day    time  size   tip_pct
141       34.30   6.70  Male     No  Thur   Lunch     6  0.195335
59        48.27   6.73  Male     No   Sat  Dinner     4  0.139424
23        39.42   7.58  Male     No   Sat  Dinner     4  0.192288
212       48.33   9.00  Male     No   Sat  Dinner     4  0.186220
170       50.81  10.00  Male    Yes   Sat  Dinner     3  0.196812

In [240]:
top(tips,6,"tip_pct")

     total_bill   tip     sex smoker  day    time  size   tip_pct
109       14.31  4.00  Female    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [241]:


tips.groupby("smoker").apply(top,n=5,column="tip_pct")

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990

In [243]:
tips.groupby("sex").apply(top, n=5, column= 'total_bill')

            total_bill    tip     sex smoker   day    time  size   tip_pct
sex
Male   182       45.35   3.50    Male    Yes   Sun  Dinner     3  0.077178
       156       48.17   5.00    Male     No   Sun  Dinner     6  0.103799
       59        48.27   6.73    Male     No   Sat  Dinner     4  0.139424
       212       48.33   9.00    Male     No   Sat  Dinner     4  0.186220
       170       50.81  10.00    Male    Yes   Sat  Dinner     3  0.196812
Female 85        34.83   5.17  Female     No  Thur   Lunch     4  0.148435
       11        35.26   5.00  Female     No   Sun  Dinner     4  0.141804
       238       35.83   4.67  Female     No   Sat  Dinner     3  0.130338
       197       43.11   5.00  Female    Yes  Thur   Lunch     4  0.115982
       102       44.30   2.50  Female    Yes   Sat  Dinner     3  0.056433

In [ ]:
tips.groupby(["smoker","day"]).apply(top,n=5,column="tip_pct")

In [ ]:
t=tips.groupby(["smoker","day","sex"]).apply(top,n=5,column="tip_pct")

In [ ]:
t[t["sex"]=="Female"]

# calling describe on GroupBy object

In [ ]:
result=tips.groupby("smoker")["tip_pct"].describe()

In [ ]:
result.unstack()

In [ ]:
# Suppressing the Group Keys

In [ ]:
tips.groupby("smoker",group_keys=False).apply(top,n=5,column="tip_pct")

In [ ]:
tips.groupby("smoker",group_keys=True).apply(top,n=5,column="tip_pct") #with group key "smoker"

## cut and qcut

In [ ]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
bins=[18,25,35,60,100]

In [ ]:
import pandas as pd
cats=pd.cut(ages,bins)
cats

In [ ]:
cats.codes

In [ ]:
cats.categories

In [ ]:
pd.value_counts(cats)  #count nos of values in each bin

In [ ]:
pd.cut(ages,bins,right=False)   

#[18,25)  [:means close and inclusive  ): means open and we can use right=True to get a ] on right.

In [ ]:
pd.cut(ages,bins,right=True)

In [ ]:
cats=pd.qcut(ages,4)

In [ ]:
cats.codes

In [ ]:
cats.categories

In [ ]:
pd.value_counts(cats) 
# samples data on sample quantiles,qcut by defination will obtain roughly equal size bins
#using cut will not result in each bin having the same number of data points.

# Quantile and Bucket Analysis

In [ ]:
frame=pd.DataFrame({'data1':np.random.randn(1000),
                    'data2':np.random.randn(1000)})

quartiles=pd.cut(frame.data1,4)
quartiles                    #function for groupby

In [ ]:
pd.value_counts(quartiles)

In [ ]:
def get_stats(group):
        return{'min':group.min(), 'max':group.max(),
               'count':group.count(), 'mean':group.mean()}

In [ ]:
grouped = frame.data2.groupby(quartiles)
grouped.apply(get_stats)    #output is a series, so to get a DataFrame use unstack()

In [ ]:
grouped.apply(get_stats).unstack()

To compute equal size of buckets based on sample quantiles, use qcut. 
# use label = False to get the quantile numbers

In [ ]:
grouping= pd.qcut(frame.data1,10,labels=False)
grouped=frame.data2.groupby(grouping)

In [ ]:
grouped.apply(get_stats).unstack() # with each group number the get_stats values are displayed

In [ ]:
s = pd.Series(np.random.randn(6))

In [ ]:
s[::2]=np.nan

In [ ]:
s

In [ ]:
s.fillna(s.mean())    #replacing NA values with mean values instead od dropna()

In [ ]:
states = ['Ohio', 'New York', 'Vermount', 'Florida', 'Oregon', 'Nevada', 'California','Idaho']
group_key = ['East'] * 4 + ['West'] * 4

In [ ]:
data = pd.Series(np.random.randn(8), index = states)

In [ ]:
data

In [ ]:
data.name = 'state'

In [ ]:
group_key

In [ ]:
data[['Vermount','Nevada' ,'Idaho']] = np.nan
data

In [ ]:
data.groupby(group_key).mean()

In [ ]:
fill_mean = lambda g: g.fillna(g.mean())

In [ ]:
data.groupby(group_key).apply(fill_mean)

In [ ]:
fill_values = {'East' : 0.5, 'West' : -1}


fill_func = lambda g: g.fillna(fill_values[g.name])

In [ ]:
# the state names in the series is accesed using g.name
# the vales of series can be accessed by using g.values

In [ ]:
data[['Vermount','Nevada' ,'Idaho']] = np.nan

data

In [ ]:
data.groupby(group_key).apply(fill_func)

In [ ]:
data.index

In [ ]:
data.values


# #Example 1 : Random Sampling and Permutation

Here we first construct a deck of English-style playing cards:

In [ ]:
#Hearts, Spades, Clubs, Diamonds

In [ ]:
suits = ['H', 'S', 'C', 'D']
card_val = ((list(range(1,11))) + [10]*3) * 4
base_names = ['A'] + (list(range(2,11))) + ['J','K', 'Q']

cards = []

for suit in ['H', 'S', 'C', 'D']: 
    cards.extend(str(num) + suit for num in base_names)
    
    
len(cards)

In [ ]:
deck = pd.Series(card_val, index = cards)

In [ ]:
deck[:13]

In [ ]:
def draw(deck,n):
    return deck.sample(n)

In [ ]:
draw(deck,5)

In [ ]:
get_suit = lambda card: card[-1]  #to get last letter of a card name is the suit ex: AH is Ace of Heart, to get H,card[-1]


deck.groupby(get_suit).apply(draw,n=2)

In [ ]:
a='preet'
a[:-1]

In [ ]:
a[-1] #to get last letter

In [ ]:
deck.groupby(get_suit, group_keys = False).apply(draw,n=3)

# #Example 2 : Group Weighted Average and Correlation

under split-apply-combine paradigm of groupby, operations between columns in a DataFrame and two Series, such as a group
weighted average, are possible.

In [ ]:
df = pd.DataFrame({'category' : ['a','a','a','a','b','b','b','b'],
                   'data' : np.random.randn(8),
                   'weights' : np.random.randn(8)})

df

In [ ]:
df.groupby('category')

In [ ]:
get_wavg = lambda g : np.average( g['data'], weights = g['weights'])

In [ ]:
df.groupby('category').apply(get_wavg)

In [ ]:
close_px = pd.read_csv('stock_px.csv', parse_dates = True, index_col = 0)

In [ ]:
close_px.info()

In [ ]:
close_px[-4:]

# A DataFrame to compute yearly correlations of daily returns (computed from percent changes) with SPX.

#step 1: we create a function that computes the pairwise corr of each column with 'SPX' column.

#SPX is S&P 500 (standard and poor 500 index)

#[See this](https://www.supermoney.com/spx-vs-spy-differences-explained/) to understand the terminolgies for stock trading.

In [ ]:
spx_corr = lambda x: x.corrwith(x['SPX'])

# compute percentage change pct_change: 

rets = close_px.pct_change().dropna()

rets.head()

In [ ]:
#lastly we group these percentage changes by year,which can be extracted from each row label,
#that returns the year attribute of each datetime lable

get_year = lambda x: x.year

by_year = rets.groupby(get_year)
by_year.apply(spx_corr)

#to compute the inter-column correlations, lets compute the corr between Apple and Microsoft:

In [ ]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

## Example 3: Group-Wise Linear Regression

In [ ]:
#To execute OLS(Ordinary least squares) regression on each chunk of data.
#Define regress function using statsmodels econometrics library

In [ ]:
import statsmodels.api as sm

def regress(data,yvar,xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y,X).fit()
    return result.params

In [ ]:
by_year.apply(regress,'AAPL',['SPX'])

## Pivot Tables and Cross-Tabulation

It is a data summarization tool, that aggregates a table of data by one or more keys arranging the data in a rectangle 
with some of the group keys along the rows and some along the columns.

In [244]:
tips.head()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [246]:
tips.pivot_table(index = ['day','sex'])

                 size       tip   tip_pct  total_bill
day  sex
Thur Male    2.433333  2.980333  0.165276   18.714667
     Female  2.468750  2.575625  0.157525   16.715312
Fri  Male    2.100000  2.693000  0.143385   19.857000
     Female  2.111111  2.781111  0.199388   14.145556
Sat  Male    2.644068  3.083898  0.151577   20.802542
     Female  2.250000  2.801786  0.156470   19.680357
Sun  Male    2.810345  3.220345  0.162344   21.887241
     Female  2.944444  3.367222  0.181569   19.872222

In [247]:
tips.groupby(['day','sex']).mean() 
# both the tables are same i.e. the pivot and groupby

             total_bill       tip      size   tip_pct
day  sex
Thur Male     18.714667  2.980333  2.433333  0.165276
     Female   16.715312  2.575625  2.468750  0.157525
Fri  Male     19.857000  2.693000  2.100000  0.143385
     Female   14.145556  2.781111  2.111111  0.199388
Sat  Male     20.802542  3.083898  2.644068  0.151577
     Female   19.680357  2.801786  2.250000  0.156470
Sun  Male     21.887241  3.220345  2.810345  0.162344
     Female   19.872222  3.367222  2.944444  0.181569

In [249]:
tips.pivot_table(['tip_pct','size'],index = ['time','day'], columns = 'smoker')

                 size             tip_pct
smoker            Yes        No       Yes        No
time   day
Lunch  Thur  2.352941  2.500000  0.163863  0.160311
       Fri   1.833333  3.000000  0.188937  0.187735
Dinner Thur       NaN  2.000000       NaN  0.159744
       Fri   2.222222  2.000000  0.165347  0.139622
       Sat   2.476190  2.555556  0.147906  0.158048
       Sun   2.578947  2.929825  0.187250  0.160113

In [251]:
tips.pivot_table(['tip_pct','size'], index=['time','day'], columns='smoker', margins=True)

#we can include the partial total by passing margins=True
#Here ALL values are means without taking into account smoker vs nonsmoker(the All columns) 
#or any of the two levels of grouping on the rows

                 size                       tip_pct
smoker            Yes        No       All       Yes        No       All
time   day
Lunch  Thur  2.352941  2.500000  2.459016  0.163863  0.160311  0.161301
       Fri   1.833333  3.000000  2.000000  0.188937  0.187735  0.188765
Dinner Thur       NaN  2.000000  2.000000       NaN  0.159744  0.159744
       Fri   2.222222  2.000000  2.166667  0.165347  0.139622  0.158916
       Sat   2.476190  2.555556  2.517241  0.147906  0.158048  0.153152
       Sun   2.578947  2.929825  2.842105  0.187250  0.160113  0.166897
All          2.408602  2.668874  2.569672  0.163196  0.159328  0.160803

In [254]:
#to use different aggregation function,pass in aggfunc
tips.pivot_table('tip_pct', index=['time','smoker'], columns='day',aggfunc=len, margins=True,fill_value=0)

day            Thur  Fri  Sat  Sun  All
time   smoker
Lunch  Yes       17    6    0    0   23
       No        44    1    0    0   45
Dinner Yes        0    9   42   19   70
       No         1    3   45   57  106
All              62   19   87   76  244

## Cross-Tabulation: Crosstab

A pivot table to compute group frequencies.

In [256]:
pd.crosstab([tips.time,tips.day],tips.smoker,margins=True)

smoker       Yes   No  All
time   day
Lunch  Thur   17   44   61
       Fri     6    1    7
Dinner Thur    0    1    1
       Fri     9    3   12
       Sat    42   45   87
       Sun    19   57   76
All           93  151  244

In [262]:
penguins=sns.load_dataset('penguins')
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [263]:
pd.crosstab([penguins.sex,penguins.island],penguins.species,margins=True)

species           Adelie  Chinstrap  Gentoo  All
sex    island
Female Biscoe         22          0      58   80
       Dream          27         34       0   61
       Torgersen      24          0       0   24
Male   Biscoe         22          0      61   83
       Dream          28         34       0   62
       Torgersen      23          0       0   23
All                  146         68     119  333